cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'

# my stuff (@spruce)
brew 'sqlite'
brew 'nmap'
brew 'zsh'
brew 'zsh-completions'



cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'transmission'
cask 'vlc'

# my stuff (@spruce)
cask 'docker'
cask 'dropbox'
cask 'sequel-pro'
cask 'sublime-text'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'focus'
cask 'bettertouchtool'
cask 'bartender'
cask 'tunnelblick'
cask 'timing'
cask 'arq'
cask 'android-studio'
cask 'insomnia'
cask 'keka'
cask 'spotify'
cask 'tripmode'
cask 'wireshark'
cask 'teamviewer'
cask 'typora'
cask 'hex-fiend'

# on my private machine
cask 'daisydisk'
cask 'fantastical'
cask 'ghost'
cask 'jdownloader'
cask 'whatsapp'
cask 'ynab'